
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/12733542936)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.this[&#34;backend&#34;]
  * aws_ecr_repository.this[&#34;frontend&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecr_repository.this["backend"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "backend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Managed" = "Terraform"
        }
    }

  # aws_ecr_repository.this["frontend"] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Managed" = "Terraform"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"bfa0030a40331dcd3bd9a1d714eef4ca13f3d840","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->